<?php
// Heading
$_['heading_title']                       = 'Playful Sparkle - IndexNow';
$_['heading_fix']                         = 'Διόρθωση κοινών σφαλμάτων';
$_['heading_getting_started']             = 'Ξεκινώντας';
$_['heading_setup']                       = 'Ρύθμιση του IndexNow';
$_['heading_troubleshot']                 = 'Συνηθισμένη αντιμετώπιση προβλημάτων';
$_['heading_faq']                         = 'Συχνές ερωτήσεις';
$_['heading_contact']                     = 'Επικοινωνία με την υποστήριξη';
$_['heading_services']                    = 'Υπηρεσίες IndexNow';

// Text
$_['text_extension']                      = 'Επεκτάσεις';
$_['text_success']                        = 'Επιτυχία: Τροποποιήσατε το feed IndexNow!';
$_['text_success_generate_service_key']   = 'Επιτυχία: Δημιουργήθηκε με επιτυχία ένα νέο κλειδί υπηρεσίας!';
$_['text_success_remove_queue']           = 'Επιτυχία: Η URL που τέθηκε σε ουρά αφαιρέθηκε με επιτυχία!';
$_['text_success_clear_log']              = 'Επιτυχία: Το αρχείο καταγραφής καθαρίστηκε με επιτυχία!';
$_['text_success_clear_queue']            = 'Επιτυχία: Η ουρά καθαρίστηκε με επιτυχία!';
$_['text_success_submit_queue']           = 'Επιτυχία: Οι URL που τέθηκαν σε ουρά υποβλήθηκαν με επιτυχία!';
$_['text_success_submit_url_list']        = 'Επιτυχία: Η λίστα URL υποβλήθηκε με επιτυχία!';
$_['text_edit']                           = 'Επεξεργασία IndexNow';
$_['text_getting_started']                = '<p><strong>Επισκόπηση:</strong> Η επέκταση <strong>Playful Sparkle - IndexNow</strong> για το OpenCart 3.x+ επιτρέπει στο κατάστημά σας να ειδοποιεί αυτόματα μηχανές αναζήτησης όπως το Bing και το Yandex όταν προστίθεται, ενημερώνεται ή διαγράφεται περιεχόμενο στο κατάστημά σας. Αυτό εξασφαλίζει ταχύτερη ευρετηρίαση των αλλαγών, βελτιώνοντας την ορατότητα του καταστήματός σας και την απόδοση αναζήτησης. Προσφέρει λειτουργίες όπως χειροκίνητη υποβολή URL, υποβολή URL σε ουρά, προσαρμόσιμες ρυθμίσεις και υποστήριξη Cron.</p><p><strong>Απαιτήσεις:</strong> OpenCart 3.x+, PHP 7.3 ή νεότερη.</p>';
$_['text_setup']                          = '<ul><li><strong>Βήμα 1: Εγκαταστήστε την Επέκταση</strong> - Κατεβάστε και εγκαταστήστε την επέκταση μέσω του πίνακα διαχείρισης του OpenCart. Μετά την εγκατάσταση, το κλειδί υπηρεσίας θα δημιουργηθεί αυτόματα για κάθε κατάστημα.</li>
<li><strong>Βήμα 2: Ενεργοποιήστε την Επέκταση για το Κατάστημά σας</strong> - Μεταβείτε στις ρυθμίσεις της επέκτασης και ενεργοποιήστε την επέκταση για κάθε κατάστημα όπου θέλετε να χρησιμοποιήσετε τις υπηρεσίες IndexNow.</li>
<li><strong>Βήμα 3: Ενεργοποιήστε τις Υπηρεσίες IndexNow για το Κατάστημά σας</strong> - Στις ρυθμίσεις της επέκτασης, ενεργοποιήστε τις υπηρεσίες IndexNow για το επιλεγμένο κατάστημα. Μπορείτε επίσης να επιλέξετε να ενεργοποιήσετε ή να απενεργοποιήσετε συγκεκριμένες υπηρεσίες IndexNow για κάθε κατάστημα.</li>
<li><strong>Βήμα 4: Ορίστε τις Επιλογές Ειδοποίησης Μηχανών Αναζήτησης</strong> - Ενεργοποιήστε αυτές τις επιλογές για να ειδοποιούνται οι μηχανές αναζήτησης όταν προστίθεται, ενημερώνεται ή διαγράφεται περιεχόμενο όπως κατηγορίες, προϊόντα, κατασκευαστές ή άρθρα. Αυτό διασφαλίζει ότι οι μηχανές αναζήτησης παραμένουν ενημερωμένες.</li>
<li><strong>Βήμα 5: Αναδημιουργήστε το Κλειδί Υπηρεσίας (Προαιρετικό)</strong> - Εάν χρειαστεί, μπορείτε να αναδημιουργήσετε το κλειδί υπηρεσίας σας για κάθε κατάστημα ξεχωριστά μέσω των ρυθμίσεων της επέκτασης.</li>
<li><strong>Βήμα 6: Υποβολή URL</strong> - Υποβάλετε URL στις υπηρεσίες IndexNow είτε υποβάλλοντας τις URL που βρίσκονται στην ουρά, είτε εισάγοντας/ανεβάζοντας το XML sitemap σας, είτε εισάγοντας χειροκίνητα μια URL και υποβάλλοντάς την στις υπηρεσίες IndexNow.</li>
<li><strong>Βήμα 7: Παρακολούθηση Αρχείων Καταγραφής</strong> - Μόλις υποβληθούν οι URL, μπορείτε να ελέγξετε την καρτέλα "Αρχείο Καταγραφής" για να δείτε τα αποτελέσματα των υποβολών. Μπορείτε επίσης να καθαρίσετε το αρχείο καταγραφής εάν χρειαστεί.</li></ul>';
$_['text_troubleshot']                    = '<details><summary><strong>Η λίστα URL που υποβλήθηκε περιέχει μη έγκυρες URL ή URL με έναν host που δεν ταιριάζει με το ενεργό κατάστημα</strong></summary> Βεβαιωθείτε ότι το πεδίο κειμένου της λίστας URL περιέχει έγκυρες URL και ότι ο host (τομέας) των URL ταιριάζει με τον τομέα του ενεργού καταστήματος.</details>
<details><summary><strong>Δεν ήταν δυνατή η λήψη του αρχείου sitemap xyz</strong></summary> Βεβαιωθείτε ότι η URL του sitemap έχει εισαχθεί σωστά.</details>
<details><summary><strong>Μη έγκυρος τύπος αρχείου. Παρακαλώ ανεβάστε ένα έγκυρο αρχείο</strong></summary> Βεβαιωθείτε ότι ανεβάζετε ένα έγκυρο αρχείο XML sitemap.</details>
<details><summary><strong>Η λίστα αναμονής δεν έχει συμπληρωθεί</strong></summary> Βεβαιωθείτε ότι είναι ενεργοποιημένες οι επιλογές για την ειδοποίηση των μηχανών αναζήτησης. Αυτές οι επιλογές επιτρέπουν στο σύστημα να θέσει σε ουρά URL για κατηγορίες, προϊόντα, κατασκευαστές ή άρθρα κάθε φορά που προστίθενται, ενημερώνονται ή διαγράφονται.</details>
<details><summary><strong>Δεν είναι ενεργοποιημένες υπηρεσίες. Παρακαλώ ενεργοποιήστε τουλάχιστον μία υπηρεσία</strong></summary> Πρέπει να ενεργοποιήσετε τουλάχιστον μία υπηρεσία IndexNow πριν κάνετε κλικ στο κουμπί "Υποβολή URL σε Ουρά".</details>';
$_['text_faq']                            = '<details><summary><strong>Πώς μπορώ να ενεργοποιήσω ή να απενεργοποιήσω την επέκταση για κάθε κατάστημα;</strong></summary><p>Μπορείτε να ενεργοποιήσετε ή να απενεργοποιήσετε την επέκταση για κάθε κατάστημα ξεχωριστά μέσω των ρυθμίσεων της επέκτασης.</p></details>
<details><summary><strong>Μπορώ να ενεργοποιήσω ή να απενεργοποιήσω τις υπηρεσίες IndexNow για κάθε κατάστημα;</strong></summary><p>Ναι, μπορείτε να ενεργοποιήσετε ή να απενεργοποιήσετε τις υπηρεσίες IndexNow για κάθε κατάστημα ξεχωριστά στις ρυθμίσεις της επέκτασης.</p></details>
<details><summary><strong>Πώς μπορώ να δημιουργήσω ένα κλειδί υπηρεσίας για κάθε κατάστημα;</strong></summary><p>Το κλειδί υπηρεσίας δημιουργείται αυτόματα κατά την εγκατάσταση και είναι μοναδικό για κάθε κατάστημα. Δεν χρειάζεται να το δημιουργήσετε χειροκίνητα.</p></details>
<details><summary><strong>Μπορώ να αναδημιουργήσω το κλειδί υπηρεσίας για κάθε κατάστημα;</strong></summary><p>Ναι, μπορείτε να αναδημιουργήσετε το κλειδί υπηρεσίας για κάθε κατάστημα ξεχωριστά μέσω των ρυθμίσεων της επέκτασης. Αυτό σας επιτρέπει να ανανεώσετε ή να αλλάξετε το κλειδί όπως χρειάζεται.</p></details>
<details><summary><strong>Μπορώ να χρησιμοποιήσω μια προσαρμοσμένη URL Cron για την αποστολή URL στις υπηρεσίες IndexNow;</strong></summary><p>Ναι, μπορείτε να επιλέξετε να χρησιμοποιήσετε είτε την URL Cron που παρέχεται από την επέκταση είτε την URL της σελίδας Cron του OpenCart για την αποστολή των URL που βρίσκονται στην ουρά. Και οι δύο επιλογές λειτουργούν χωρίς κανένα πρόβλημα.</p></details>
<details><summary><strong>Ποια είναι τα όρια μεγέθους και URL για το sitemap;</strong></summary><p>Το αρχείο sitemap μπορεί να έχει μέγεθος έως 50MB και να περιέχει έως 50.000 URL. Βεβαιωθείτε ότι το sitemap σας δεν υπερβαίνει αυτά τα όρια.</p></details>
<details><summary><strong>Πώς μπορώ να υποβάλω URL στις υπηρεσίες IndexNow;</strong></summary><p>Μπορείτε να υποβάλετε URL στις υπηρεσίες IndexNow εισάγοντας ένα sitemap, ανεβάζοντας ένα αρχείο XML sitemap ή πληκτρολογώντας χειροκίνητα την URL του sitemap. Επιπλέον, μπορείτε να υποβάλετε μεμονωμένες URL από την ουρά ή να στείλετε όλες τις URL που βρίσκονται στην ουρά ταυτόχρονα για το επιλεγμένο κατάστημα.</p></details>
<details><summary><strong>Πώς μπορώ να καθαρίσω το αρχείο καταγραφής υποβολής URL;</strong></summary><p>Μπορείτε να καθαρίσετε το αρχείο καταγραφής στην καρτέλα "Αρχείο Καταγραφής". Το αρχείο καταγραφής καθαρίζεται χωρίς σφάλματα κάθε φορά που επιλέγετε να το καθαρίσετε.</p></details>';
$_['text_contact']                        = '<p>Για περαιτέρω βοήθεια, επικοινωνήστε με την ομάδα υποστήριξής μας:</p><ul><li><strong>Επικοινωνία:</strong> <a href="mailto:%s">%s</a></li><li><strong>Τεκμηρίωση:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Εγχειρίδιο Χρήσης</a></li></ul>';
$_['text_log_no_results']                 = 'Δεν υπάρχουν καταχωρήσεις στο αρχείο καταγραφής αυτή τη στιγμή.';
$_['text_queue_no_results']               = 'Δεν υπάρχουν URL σε ουρά αυτή τη στιγμή.';
$_['text_categories']                     = 'Οι κατηγορίες στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_products']                       = 'Τα προϊόντα στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_manufacturers']                  = 'Οι κατασκευαστές στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_information']                    = 'Οι σελίδες πληροφοριών στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_topics']                         = 'Τα θέματα άρθρων στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_articles']                       = 'Τα άρθρα στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_url_list_warning']               = 'Οι URL που θα επικολλήσετε θα επικυρωθούν. Κάθε URL πρέπει να είναι σωστά διαμορφωμένη με "http" ή "https" και ο host της πρέπει να ταιριάζει με τον host του καταστήματος: "%s". Μπορούν να υποβληθούν έως και 10.000 URL.';
$_['text_http_status_code']               = 'Η ανάλυση των κωδικών κατάστασης HTTP από τις υπηρεσίες IndexNow σάς βοηθά να κατανοήσετε εάν τα αιτήματά σας υποβλήθηκαν με επιτυχία ή αντιμετώπισαν προβλήματα. Αυτοί οι κωδικοί παρέχουν πληροφορίες για τα αποτελέσματα ευρετηρίασης URL και πιθανά σφάλματα. Επισκεφθείτε τις ακόλουθες υπηρεσίες IndexNow για να μάθετε περισσότερα σχετικά με τους κωδικούς κατάστασης HTTP:<br><br><ul><li><a href="https://www.bing.com/indexnow/getstarted"target="_blank" rel="noopener noreferrer">Microsoft Bing Webmaster Tools</a></li><li><a href="https://searchadvisor.naver.com/guide/indexnow-request"target="_blank" rel="noopener noreferrer">Naver Search Advisor</a></li><li><a href="https://napoveda.seznam.cz/cz/fulltext-hledani-v-internetu/protokol-indexnow/odeslani-vice-stranek-jednim-pozadavkem/"target="_blank" rel="noopener noreferrer">Seznam.cz</a></li><li><a href="https://yandex.com/support/webmaster/indexnow/reference/post-url.html"target="_blank" rel="noopener noreferrer">Yandex Webmaster Tools</a></li></ul>';

// Column
$_['column_log_id']                       = 'Αναγνωριστικό Καταγραφής';
$_['column_log_url']                      = 'URL';
$_['column_log_service_name']             = 'Όνομα Υπηρεσίας';
$_['column_log_status_code']              = 'Κωδικός Κατάστασης';
$_['column_log_date_added']               = 'Ημερομηνία Προσθήκης';
$_['column_queue_id']                     = 'Αναγνωριστικό Ουράς';
$_['column_queue_url']                    = 'URL';
$_['column_queue_date_added']             = 'Ημερομηνία Προσθήκης';
$_['column_queue_action']                 = 'Ενέργεια';

// Tab
$_['tab_general']                         = 'Γενικά';
$_['tab_manual_submit']                   = 'Χειροκίνητη Υποβολή';
$_['tab_queue']                           = 'Ουρά';
$_['tab_log']                             = 'Αρχείο Καταγραφής';
$_['tab_help_and_support']                = 'Βοήθεια &amp; Υποστήριξη';

// Entry
$_['entry_status']                        = 'Κατάσταση';
$_['entry_service_key']                   = 'Κλειδί Υπηρεσίας';
$_['entry_service_key_location']          = 'URL Κλειδιού Υπηρεσίας';
$_['entry_active_store']                  = 'Ενεργό Κατάστημα';
$_['entry_notify_search_engines']         = 'Ειδοποίηση Μηχανών Αναζήτησης';
$_['entry_url_list']                      = 'Λίστα URL';
$_['entry_load_sitemap']                  = 'Φόρτωση Sitemap';
$_['entry_cron_url']                      = 'URL Cron';

// Button
$_['button_fix_event_handler']            = 'Διόρθωση Χειριστή Συμβάντων';
$_['button_change_key']                   = 'Αλλαγή Κλειδιού';
$_['button_check_key']                    = 'Έλεγχος Κλειδιού';
$_['button_submit_url']                   = 'Υποβολή URL';
$_['button_submit_queue']                 = 'Υποβολή URL σε Ουρά';
$_['button_clear_queue']                  = 'Εκκαθάριση URL σε Ουρά';
$_['button_clear_log']                    = 'Εκκαθάριση Αρχείου Καταγραφής';
$_['button_submit_url_list']              = 'Υποβολή Λίστας URL';
$_['button_clear_url_list']               = 'Εκκαθάριση Λίστας URL';
$_['button_upload_sitemap']               = 'Ανέβασμα URL Sitemap';
$_['button_import_sitemap']               = 'Εισαγωγή URL Sitemap';
$_['button_copy']                         = 'Αντιγραφή URL';

// Help
$_['help_service_key']                    = 'Το κλειδί API του IndexNow επαληθεύει την ιδιοκτησία του ιστότοπου και δημιουργείται αυτόματα. Αλλάξτε το κλειδί εάν τεθεί σε κίνδυνο.';
$_['help_service_key_location']           = 'Κάντε κλικ στο κουμπί "Έλεγχος Κλειδιού" για να βεβαιωθείτε ότι το κλειδί είναι προσβάσιμο στις μηχανές αναζήτησης. Αυτό θα πρέπει να ανοίξει την ενεργή URL όπου βρίσκεται το κλειδί.';
$_['help_url_list']                       = 'Εισαγάγετε μια λίστα URL, μία ανά γραμμή (έως 10.000). Βεβαιωθείτε ότι κάθε URL είναι σωστά διαμορφωμένη με "http" ή "https". Κάντε κλικ στο "Υποβολή Λίστας URL" για να στείλετε τις URL στις επιλεγμένες υπηρεσίες IndexNow.';
$_['help_load_sitemap']                   = 'Μπορείτε είτε να παρέχετε μια URL sitemap είτε να ανεβάσετε ένα αρχείο sitemap.xml (έως 50MB ή 50.000 URL). Οι URL από το sitemap θα προστεθούν στη λίστα και θα σταλούν στην επιλεγμένη υπηρεσία IndexNow. Θα ειδοποιηθείτε μόλις ολοκληρωθεί η διαδικασία.';
$_['help_cron_url']                       = 'Προσθέστε αυτήν την URL στον πίνακα cron του διακομιστή φιλοξενίας σας. Θα στείλει αυτόματα <strong>όλες τις URL σε ουρά</strong> από <strong>όλα τα διαμορφωμένα καταστήματα</strong> στα <strong>επιλεγμένα τελικά σημεία υπηρεσίας IndexNow</strong> σε προγραμματισμένα διαστήματα. Εναλλακτικά, μπορείτε να χρησιμοποιήσετε την URL <a href="%s">OpenCart 4 Cron Jobs</a> για να υποβάλετε URL στα τελικά σημεία υπηρεσίας IndexNow.';

// Error
$_['error_permission']                    = 'Προειδοποίηση: Δεν έχετε άδεια να τροποποιήσετε την επέκταση IndexNow!';
$_['error_generate_service_key']          = 'Προειδοποίηση: Δεν είναι δυνατή η δημιουργία νέου κλειδιού υπηρεσίας!';
$_['error_remove_queue']                  = 'Προειδοποίηση: Δεν είναι δυνατή η αφαίρεση των URL σε ουρά!';
$_['error_not_configured']                = 'Προειδοποίηση: Η επέκταση IndexNow δεν έχει ρυθμιστεί!';
$_['error_filetype']                      = 'Προειδοποίηση: Μη έγκυρος τύπος αρχείου. Παρακαλώ ανεβάστε ένα έγκυρο αρχείο.';
$_['error_upload']                        = 'Προειδοποίηση: Δεν ήταν δυνατή η μεταφόρτωση του αρχείου.';
$_['error_download']                      = 'Προειδοποίηση: Δεν ήταν δυνατή η λήψη του αρχείου sitemap "%s"';
$_['error_invalid_url']                   = 'Προειδοποίηση: Η URL είναι μη έγκυρη. Παρακαλώ δώστε μια έγκυρη URL.';
$_['error_invalid_url_host']              = 'Προειδοποίηση: Ο host της URL είναι μη έγκυρος. Ο host της URL πρέπει να είναι ο ίδιος με τον τρέχοντα host της URL.';
$_['error_no_services_enabled']           = 'Προειδοποίηση: Δεν είναι ενεργοποιημένες υπηρεσίες. Παρακαλώ ενεργοποιήστε τουλάχιστον μία υπηρεσία.';
$_['error_submit_url_list_empty']         = 'Προειδοποίηση: Η λίστα URL που υποβλήθηκε είναι κενή.';
$_['error_submit_url_list_invalid']       = 'Προειδοποίηση: Η λίστα URL που υποβλήθηκε περιέχει μη έγκυρες URL ή URL με έναν host που δεν ταιριάζει με το ενεργό κατάστημα.';
$_['error_empty_queue']                   = 'Προειδοποίηση: Η ουρά είναι κενή.';
$_['error_file_upload_limit']             = 'Προειδοποίηση: Το μέγεθος του αρχείου υπερβαίνει το όριο των 50MB. Παρακαλώ ανεβάστε ένα μικρότερο αρχείο.';
$_['error_service_key']                   = 'Το κλειδί υπηρεσίας είναι μη έγκυρο. Παρακαλώ δώστε ένα έγκυρο κλειδί υπηρεσίας.';
$_['error_service_key_location']          = 'Η τοποθεσία του κλειδιού υπηρεσίας είναι μη έγκυρη. Παρακαλώ δώστε μια έγκυρη τοποθεσία κλειδιού υπηρεσίας.';
