<?php
// Heading
$_['heading_title']                           = 'Playful Sparkle - IndexNow';
$_['heading_getting_started']                 = 'Πρώτα Βήματα';
$_['heading_setup']                           = 'Ρύθμιση του IndexNow';
$_['heading_troubleshot']                     = 'Αντιμετώπιση Κοινών Προβλημάτων';
$_['heading_faq']                             = 'Συχνές Ερωτήσεις';
$_['heading_contact']                         = 'Επικοινωνία με την Υποστήριξη';
$_['entry_indexnow_services']                 = 'Υπηρεσίες IndexNow';

// Text
$_['text_extension']                          = 'Επεκτάσεις';
$_['text_success']                            = 'Επιτυχία: Έχετε τροποποιήσει την τροφοδοσία IndexNow!';
$_['text_success_generate_service_key']       = 'Επιτυχία: Το νέο κλειδί υπηρεσίας δημιουργήθηκε με επιτυχία!';
$_['text_success_remove_queue']               = 'Επιτυχία: Το URL αφαιρέθηκε με επιτυχία από την ουρά αναμονής!';
$_['text_success_clear_log']                  = 'Επιτυχία: Το αρχείο καταγραφής εκκαθαρίστηκε με επιτυχία!';
$_['text_success_clear_queue']                = 'Επιτυχία: Η ουρά αναμονής εκκαθαρίστηκε με επιτυχία!';
$_['text_success_submit_queue']               = 'Επιτυχία: Τα URLs στην ουρά αναμονής υποβλήθηκαν με επιτυχία!';
$_['text_success_submit_url_list']            = 'Επιτυχία: Η λίστα URL υποβλήθηκε με επιτυχία!';
$_['text_edit']                               = 'Επεξεργασία IndexNow';
$_['text_getting_started']                    = '<p><strong>Επισκόπηση:</strong> Η επέκταση <strong>Playful Sparkle - IndexNow</strong> για το OpenCart 3.x+ επιτρέπει στο κατάστημά σας να ενημερώνει αυτόματα τις μηχανές αναζήτησης, όπως η Bing και η Yandex, όταν το περιεχόμενο του καταστήματός σας προστίθεται, ενημερώνεται ή διαγράφεται. Αυτό εξασφαλίζει ταχύτερη ευρετηρίαση των αλλαγών, βελτιώνοντας την προβολή και την απόδοση του καταστήματός σας στις αναζητήσεις. Προσφέρει λειτουργίες όπως χειροκίνητη υποβολή URL, υποβολή URL σε ουρά αναμονής, προσαρμόσιμες ρυθμίσεις και υποστήριξη Cron.</p><p><strong>Απαιτήσεις:</strong> OpenCart 3.x+, PHP 7.3 ή νεότερη.</p>';
$_['text_setup']                              = '<ul><li><strong>Βήμα 1: Εγκατάσταση της επέκτασης</strong> - Μεταφορτώστε και εγκαταστήστε την επέκταση στον πίνακα διαχείρισης του OpenCart. Μετά την εγκατάσταση, δημιουργείται αυτόματα ένα κλειδί υπηρεσίας για κάθε κατάστημα.</li><li><strong>Βήμα 2: Ανανέωση τροποποιήσεων</strong> - Μεταβείτε στις <strong>Επεκτάσεις &gt; Τροποποιήσεις</strong> και κάντε κλικ στο <strong>Ανανέωση</strong> για την ανακατασκευή της προσωρινής μνήμης (cache) των τροποποιήσεων.</li><li><strong>Βήμα 3: Ενεργοποίηση της επέκτασης ανά κατάστημα</strong> - Ανοίξτε τις ρυθμίσεις της επέκτασης και ενεργοποιήστε την για κάθε κατάστημα όπου επιθυμείτε να χρησιμοποιήσετε το IndexNow.</li><li><strong>Βήμα 4: Επιλογή υπηρεσίας IndexNow</strong> - Επιλέξτε το τελικό σημείο (endpoint) IndexNow στο οποίο θέλετε να κάνετε υποβολή.</li><li><strong>Βήμα 5: Ρύθμιση αυτόματης ειδοποίησης</strong> - Ενεργοποιήστε τις επιλογές αυτόματης ειδοποίησης για την υποβολή URL όταν προστίθενται, ενημερώνονται ή διαγράφονται κατηγορίες, προϊόντα, κατασκευαστές ή άρθρα.</li><li><strong>Βήμα 6: Επαναδημιουργία κλειδιού υπηρεσίας (προαιρετικό)</strong> - Εάν απαιτείται, μπορείτε να δημιουργήσετε ξανά το κλειδί υπηρεσίας ξεχωριστά για κάθε κατάστημα μέσω των ρυθμίσεων της επέκτασης.</li><li><strong>Βήμα 7: Υποβολή URLs</strong> - Υποβάλετε URLs επεξεργαζόμενοι την ουρά αναμονής, εισάγοντας το XML sitemap σας, μεταφορτώνοντας ένα αρχείο sitemap ή εισάγοντας χειροκίνητα τα URLs.</li><li><strong>Βήμα 8: Παρακολούθηση αρχείων καταγραφής</strong> - Μετά την υποβολή, ελέγξτε την καρτέλα <strong>Αρχείο Καταγραφής</strong> για τα αποτελέσματα. Μπορείτε επίσης να εκκαθαρίσετε το αρχείο εάν χρειαστεί.</li></ul>';
$_['text_troubleshot']                        = '<details><summary><strong>Η λίστα URL που υποβλήθηκε περιέχει μη έγκυρα URLs ή URLs με κεντρικό υπολογιστή (host) που δεν ταιριάζει με το ενεργό κατάστημα</strong></summary> Βεβαιωθείτε ότι το πεδίο κειμένου της λίστας URL περιέχει έγκυρα URLs και ότι ο κεντρικός υπολογιστής (domain) των URLs αντιστοιχεί στο domain του ενεργού καταστήματος.</details>
<details><summary><strong>Αδυναμία λήψης του αρχείου sitemap xyz</strong></summary> Βεβαιωθείτε ότι η διεύθυνση URL του sitemap έχει εισαχθεί σωστά.</details>
<details><summary><strong>Μη έγκυρος τύπος αρχείου. Παρακαλούμε μεταφορτώστε ένα έγκυρο αρχείο</strong></summary> Βεβαιωθείτε ότι μεταφορτώνετε ένα έγκυρο αρχείο XML sitemap.</details>
<details><summary><strong>Η λίστα ουράς αναμονής δεν είναι συμπληρωμένη</strong></summary> Βεβαιωθείτε ότι οι επιλογές ειδοποίησης των μηχανών αναζήτησης είναι ενεργοποιημένες. Αυτές οι επιλογές επιτρέπουν στο σύστημα να θέτει σε ουρά αναμονής τα URLs για κατηγορίες, προϊόντα, κατασκευαστές ή άρθρα κάθε φορά που αυτά προστίθενται, ενημερώνονται ή διαγράφονται.</details>
<details><summary><strong>Δεν έχουν ενεργοποιηθεί υπηρεσίες. Παρακαλούμε ενεργοποιήστε τουλάχιστον μία υπηρεσία</strong></summary> Πρέπει να ενεργοποιήσετε τουλάχιστον μία υπηρεσία IndexNow πριν κάνετε κλικ στο κουμπί "Υποβολή URLs στην Ουρά".</details>';
$_['text_faq']                                = '<details><summary><strong>Πώς μπορώ να ενεργοποιήσω ή να απενεργοποιήσω την επέκταση για κάθε κατάστημα;</strong></summary><p>Μπορείτε να ενεργοποιήσετε ή να απενεργοποιήσετε την επέκταση για κάθε κατάστημα ξεχωριστά μέσω των ρυθμίσεων της επέκτασης.</p></details>
<details><summary><strong>Μπορώ να ενεργοποιήσω ή να απενεργοποιήσω τις υπηρεσίες IndexNow για κάθε κατάστημα;</strong></summary><p>Ναι, μπορείτε να ενεργοποιήσετε ή να απενεργοποιήσετε τις υπηρεσίες IndexNow για κάθε κατάστημα μεμονωμένα στις ρυθμίσεις της επέκτασης.</p></details>
<details><summary><strong>Πώς δημιουργώ ένα κλειδί υπηρεσίας για κάθε κατάστημα;</strong></summary><p>Το κλειδί υπηρεσίας δημιουργείται αυτόματα κατά την εγκατάσταση και είναι μοναδικό για κάθε κατάστημα. Δεν χρειάζεται να το δημιουργήσετε χειροκίνητα.</p></details>
<details><summary><strong>Μπορώ να δημιουργήσω ξανά το κλειδί υπηρεσίας για κάθε κατάστημα;</strong></summary><p>Ναι, μπορείτε να επαναδημιουργήσετε το κλειδί υπηρεσίας για κάθε κατάστημα ξεχωριστά μέσω των ρυθμίσεων της επέκτασης. Αυτό σας επιτρέπει να ανανεώσετε ή να αλλάξετε το κλειδί ανάλογα με τις ανάγκες σας.</p></details>
<details><summary><strong>Μπορώ να χρησιμοποιήσω μια προσαρμοσμένη διεύθυνση Cron για την αποστολή URLs στις υπηρεσίες IndexNow;</strong></summary><p>Ναι, μπορείτε να επιλέξετε να χρησιμοποιήσετε είτε τη διεύθυνση URL Cron που παρέχεται από την επέκταση είτε τη διεύθυνση URL της σελίδας Cron του OpenCart. Και οι δύο επιλογές λειτουργούν χωρίς προβλήματα.</p></details>
<details><summary><strong>Ποια είναι τα όρια μεγέθους και αριθμού URL για το sitemap;</strong></summary><p>Το αρχείο sitemap μπορεί να έχει μέγεθος έως 50MB και να περιέχει έως 50.000 URLs. Βεβαιωθείτε ότι το sitemap σας δεν υπερβαίνει αυτά τα όρια.</p></details>
<details><summary><strong>Πώς μπορώ να υποβάλω URLs στις υπηρεσίες IndexNow;</strong></summary><p>Μπορείτε να υποβάλετε URLs εισάγοντας ένα sitemap, μεταφορτώνοντας ένα αρχείο XML sitemap ή πληκτρολογώντας τη διεύθυνση URL του sitemap χειροκίνητα. Επιπλέον, μπορείτε να υποβάλετε μεμονωμένα URLs από την ουρά ή να στείλετε όλα τα URLs της ουράς ταυτόχρονα για το επιλεγμένο κατάστημα.</p></details>
<details><summary><strong>Πώς μπορώ να εκκαθαρίσω το αρχείο καταγραφής υποβολής URL;</strong></summary><p>Μπορείτε να εκκαθαρίσετε το αρχείο καταγραφής στην καρτέλα "Αρχείο Καταγραφής". Το αρχείο εκκαθαρίζεται χωρίς σφάλματα όποτε το επιλέξετε.</p></details>';
$_['text_contact']                            = '<p>Για περαιτέρω βοήθεια, επικοινωνήστε με την ομάδα υποστήριξής μας:</p><ul><li><strong>Επικοινωνία:</strong> <a href="mailto:%s">%s</a></li><li><strong>Τεκμηρίωση:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Τεκμηρίωση Χρήστη</a></li></ul>';
$_['text_log_no_results']                  = 'Δεν υπάρχουν διαθέσιμες εγγραφές στο αρχείο καταγραφής αυτή τη στιγμή.';
$_['text_queue_no_results']                = 'Δεν υπάρχουν URLs στην ουρά αναμονής αυτή τη στιγμή.';
$_['text_categories']                         = 'Οι κατηγορίες στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_products']                           = 'Τα προϊόντα στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_manufacturers']                      = 'Οι κατασκευαστές στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_information']                        = 'Οι σελίδες πληροφοριών στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_articles']                           = 'Τα άρθρα στον ιστότοπό σας προστίθενται, ενημερώνονται ή διαγράφονται';
$_['text_url_list_warning']                   = 'Τα URLs που επικολλάτε θα επικυρωθούν. Κάθε URL πρέπει να είναι σωστά μορφοποιημένο με "http" ή "https" και ο κεντρικός υπολογιστής του πρέπει να ταιριάζει με αυτόν του καταστήματος: "%s". Μπορούν να υποβληθούν έως 10.000 URLs.';
$_['text_http_status_code']                   = 'Η ανάλυση των κωδικών κατάστασης απόκρισης HTTP από τις υπηρεσίες IndexNow σάς βοηθά να κατανοήσετε εάν τα αιτήματά σας υποβλήθηκαν σε επεξεργασία με επιτυχία ή αν αντιμετώπισαν προβλήματα. Αυτοί οι κωδικοί παρέχουν πληροφορίες σχετικά με τα αποτελέσματα ευρετηρίασης των URL και πιθανά σφάλματα. Επισκεφθείτε τις ακόλουθες υπηρεσίες IndexNow για να μάθετε περισσότερα σχετικά με τους κωδικούς κατάστασης HTTP:<br><br><ul><li><a href="https://www.bing.com/indexnow/getstarted"target="_blank" rel="noopener noreferrer">Microsoft Bing Webmaster Tools</a></li><li><a href="https://searchadvisor.naver.com/guide/indexnow-request"target="_blank" rel="noopener noreferrer">Naver Search Advisor</a></li><li><a href="https://napoveda.seznam.cz/cz/fulltext-hledani-v-internetu/protokol-indexnow/odeslani-vice-stranek-jednim-pozadavkem/"target="_blank" rel="noopener noreferrer">Seznam.cz</a></li><li><a href="https://yandex.com/support/webmaster/indexnow/reference/post-url.html"target="_blank" rel="noopener noreferrer">Yandex Webmaster Tools</a></li></ul>';

// Column
$_['column_log_id']                           = 'ID Καταγραφής';
$_['column_log_url']                          = 'URL';
$_['column_log_service_name']                 = 'Όνομα Υπηρεσίας';
$_['column_log_status_code']                  = 'Κωδικός Κατάστασης';
$_['column_log_date_added']                   = 'Ημερομηνία Προσθήκης';
$_['column_queue_id']                         = 'ID Ουράς';
$_['column_queue_url']                        = 'URL';
$_['column_queue_date_added']                 = 'Ημερομηνία Προσθήκης';
$_['column_queue_action']                     = 'Ενέργεια';

// Tab
$_['tab_general']                             = 'Γενικά';
$_['tab_manual_submit']                       = 'Χειροκίνητη Υποβολή';
$_['tab_queue']                               = 'Ουρά Αναμονής';
$_['tab_log']                                 = 'Αρχείο Καταγραφής';
$_['tab_help_and_support']                    = 'Βοήθεια & Υποστήριξη';

// Entry
$_['entry_status']                            = 'Κατάσταση';
$_['entry_service_key']                       = 'Κλειδί Υπηρεσίας';
$_['entry_service_key_location']              = 'URL Κλειδιού Υπηρεσίας';
$_['entry_active_store']                      = 'Ενεργό Κατάστημα';
$_['entry_notify_search_engines']             = 'Ειδοποίηση Μηχανών Αναζήτησης';
$_['entry_url_list']                          = 'Λίστα URL';
$_['entry_load_sitemap']                      = 'Φόρτωση Sitemap';
$_['entry_cron_url']                          = 'URL Cron';

// Button
$_['button_change_key']                       = 'Αλλαγή Κλειδιού';
$_['button_check_key']                        = 'Έλεγχος Κλειδιού';
$_['button_submit_url']                       = 'Υποβολή URL';
$_['button_submit_queue']                     = 'Υποβολή URLs στην Ουρά';
$_['button_clear_queue']                      = 'Εκκαθάριση URLs στην Ουρά';
$_['button_clear_log']                        = 'Εκκαθάριση Αρχείου Καταγραφής';
$_['button_submit_url_list']                  = 'Υποβολή Λίστας URL';
$_['button_clear_url_list']                   = 'Εκκαθάριση Λίστας URL';
$_['button_upload_sitemap']                   = 'Μεταφόρτωση URLs από Sitemap';
$_['button_import_sitemap']                   = 'Εισαγωγή URLs από Sitemap';
$_['button_copy']                             = 'Αντιγραφή URL';

// Help
$_['help_service_key']                        = 'Το κλειδί API IndexNow επαληθεύει την ιδιοκτησία του ιστότοπου και δημιουργείται αυτόματα. Αλλάξτε το κλειδί εάν θεωρείτε ότι έχει παραβιαστεί.';
$_['help_service_key_location']               = 'Κάντε κλικ στο κουμπί "Έλεγχος Κλειδιού" για να βεβαιωθείτε ότι το κλειδί είναι προσβάσιμο από τις μηχανές αναζήτησης. Αυτό θα πρέπει να ανοίξει τη ζωντανή διεύθυνση URL όπου βρίσκεται το κλειδί.';
$_['help_url_list']                           = 'Εισαγάγετε μια λίστα με URLs, ένα ανά γραμμή (έως 10.000). Βεβαιωθείτε ότι κάθε URL είναι σωστά μορφοποιημένο με "http" ή "https". Κάντε κλικ στο "Υποβολή Λίστας URL" για να στείλετε τα URLs στις επιλεγμένες υπηρεσίες IndexNow.';
$_['help_load_sitemap']                       = 'Μπορείτε είτε να παρέχετε μια διεύθυνση URL sitemap είτε να μεταφορτώσετε ένα αρχείο sitemap.xml (έως 50MB ή 50.000 URLs). Τα URLs από το sitemap θα προστεθούν στη λίστα και θα σταλούν στην επιλεγμένη υπηρεσία IndexNow. Θα ειδοποιηθείτε μόλις ολοκληρωθεί η διαδικασία.';
$_['help_cron_url']                           = 'Προσθέστε αυτή τη διεύθυνση URL στον πίνακα cron του διακομιστή φιλοξενίας σας. Θα στέλνει αυτόματα <strong>όλα τα URLs στην ουρά</strong> από <strong>όλα τα ρυθμισμένα καταστήματα</strong> στα <strong>επιλεγμένα τελικά σημεία της υπηρεσίας IndexNow</strong> σε προγραμματισμένα διαστήματα.';

// Error
$_['error_permission']                        = 'Προειδοποίηση: Δεν έχετε άδεια να τροποποιήσετε την επέκταση IndexNow!';
$_['error_generate_service_key']              = 'Προειδοποίηση: Αδυναμία δημιουργίας νέου κλειδιού υπηρεσίας!';
$_['error_remove_queue']                      = 'Προειδοποίηση: Αδυναμία αφαίρεσης των URLs από την ουρά!';
$_['error_not_configured']                    = 'Προειδοποίηση: Η επέκταση IndexNow δεν έχει ρυθμιστεί!';
$_['error_filetype']                          = 'Προειδοποίηση: Μη έγκυρος τύπος αρχείου. Παρακαλούμε μεταφορτώστε ένα έγκυρο αρχείο.';
$_['error_upload']                            = 'Προειδοποίηση: Το αρχείο δεν μπόρεσε να μεταφορτωθεί.';
$_['error_download']                          = 'Προειδοποίηση: Αδυναμία λήψης του αρχείου sitemap "%s"';
$_['error_invalid_url']                       = 'Προειδοποίηση: Η διεύθυνση URL είναι μη έγκυρη. Παρακαλούμε δώστε μια έγκυρη διεύθυνση URL.';
$_['error_invalid_url_host']                  = 'Προειδοποίηση: Ο κεντρικός υπολογιστής (host) της διεύθυνσης URL είναι μη έγκυρος. Πρέπει να είναι ίδιος με τον κεντρικό υπολογιστή της τρέχουσας διεύθυνσης URL.';
$_['error_no_services_enabled']               = 'Προειδοποίηση: Δεν έχουν ενεργοποιηθεί υπηρεσίες. Παρακαλούμε ενεργοποιήστε τουλάχιστον μία υπηρεσία.';
$_['error_submit_url_list_empty']             = 'Προειδοποίηση: Η λίστα URL που υποβλήθηκε είναι κενή.';
$_['error_submit_url_list_invalid']           = 'Προειδοποίηση: Η λίστα URL που υποβλήθηκε περιέχει μη έγκυρα URLs ή URLs με κεντρικό υπολογιστή που δεν ταιριάζει με το ενεργό κατάστημα.';
$_['error_empty_queue']                       = 'Προειδοποίηση: Η ουρά αναμονής είναι κενή.';
$_['error_file_upload_limit']                 = 'Προειδοποίηση: Το μέγεθος του αρχείου υπερβαίνει το όριο των 50MB. Παρακαλούμε μεταφορτώστε ένα μικρότερο αρχείο.';
$_['error_service_key']                       = 'Το κλειδί υπηρεσίας είναι μη έγκυρο. Παρακαλούμε δώστε ένα έγκυρο κλειδί υπηρεσίας.';
$_['error_service_key_location']              = 'Η τοποθεσία του κλειδιού υπηρεσίας είναι μη έγκυρη. Παρακαλούμε δώστε μια έγκυρη τοποθεσία κλειδιού υπηρεσίας.';
