<?php
// Heading
$_['heading_title']                       = 'Playful Sparkle - IndexNow';
$_['heading_getting_started']             = 'Начало работы';
$_['heading_setup']                       = 'Настройка IndexNow';
$_['heading_troubleshot']                 = 'Типичные проблемы';
$_['heading_faq']                         = 'Часто задаваемые вопросы';
$_['heading_contact']                     = 'Связаться с поддержкой';
$_['heading_services']                    = 'Сервисы IndexNow';

// Text
$_['text_extension']                      = 'Расширения';
$_['text_success']                        = 'Успех: Вы успешно изменили ленту IndexNow!';
$_['text_success_generate_service_key']   = 'Успех: Новый ключ сервиса успешно сгенерирован!';
$_['text_success_remove_queue']           = 'Успех: URL в очереди успешно удален!';
$_['text_success_clear_log']              = 'Успех: Лог был успешно очищен!';
$_['text_success_clear_queue']            = 'Успех: Очередь была успешно очищена!';
$_['text_success_submit_queue']           = 'Успех: URL в очереди успешно отправлены!';
$_['text_success_submit_url_list']        = 'Успех: Список URL успешно отправлен!';
$_['text_edit']                           = 'Редактировать IndexNow';
$_['text_getting_started']                = '<p><strong>Обзор:</strong> Расширение <strong>Playful Sparkle - IndexNow</strong> для OpenCart 4.x+ позволяет вашему магазину автоматически уведомлять поисковые системы, такие как Bing и Yandex, о добавлении, обновлении или удалении контента магазина. Это обеспечивает более быстрое индексирование изменений, улучшая видимость магазина и его результаты в поиске. Включает функции, такие как ручная отправка URL, отправка URL в очередь, настраиваемые параметры и поддержка Cron.</p><p><strong>Требования:</strong> OpenCart 4.x+, PHP 7.4+ или выше.</p>';
$_['text_setup']                          = '<ul><li><strong>Шаг 1: Установите расширение</strong> - Скачайте и установите расширение через панель администратора OpenCart. После установки ключ сервиса будет автоматически сгенерирован для каждого магазина.</li>
<li><strong>Шаг 2: Очистите кэш модификаций</strong> - После установки перейдите в <strong>Расширения > Модификации</strong> и нажмите кнопку <strong>Обновить</strong>, чтобы очистить кэш модификаций. Это гарантирует полную интеграцию расширения в вашу систему.</li>
<li><strong>Шаг 3: Включите расширение для вашего магазина</strong> - Перейдите в настройки расширения и включите его для каждого магазина, в котором вы хотите использовать сервисы IndexNow.</li>
<li><strong>Шаг 4: Включите сервисы IndexNow для вашего магазина</strong> - В настройках расширения включите сервисы IndexNow для выбранного магазина. Вы также можете включать или отключать отдельные сервисы IndexNow для каждого магазина.</li>
<li><strong>Шаг 5: Установите параметры уведомлений для поисковых систем</strong> - Включите эти параметры, чтобы уведомлять поисковые системы при добавлении, обновлении или удалении контента, такого как категории, товары, производители или статьи. Это гарантирует актуальность данных для поисковых систем.</li>
<li><strong>Шаг 6: Пере-сгенерируйте ключ сервиса (по желанию)</strong> - При необходимости вы можете пере-сгенерировать ключ сервиса для каждого магазина отдельно через настройки расширения.</li>
<li><strong>Шаг 7: Отправка URL</strong> - Отправьте URL в сервисы IndexNow, отправив URL в очереди, импортировав/загрузив ваш XML-карту сайта или вручную введя URL и отправив его в сервисы IndexNow.</li>
<li><strong>Шаг 8: Мониторинг журналов</strong> - После отправки URL вы можете проверить вкладку "Журнал", чтобы увидеть результаты отправок. Вы также можете очистить журнал при необходимости.</li></ul>';
$_['text_troubleshot']                    = '<details><summary><strong>Список отправленных URL содержит недействительные URL или URL с хостом, не соответствующим активному магазину</strong></summary> Убедитесь, что текстовое поле для списка URL содержит действительные URL и что домен (хост) URL совпадает с доменом активного магазина.</details>
<details><summary><strong>Не удалось скачать файл карты сайта xyz</strong></summary> Убедитесь, что URL карты сайта введен правильно.</details>
<details><summary><strong>Неверный тип файла. Пожалуйста, загрузите действительный файл</strong></summary> Убедитесь, что вы загружаете действительный XML-файл карты сайта.</details>
<details><summary><strong>Список очереди не заполнен</strong></summary> Убедитесь, что включены параметры уведомлений для поисковых систем. Эти параметры позволяют системе ставить URL для категорий, товаров, производителей или статей в очередь при их добавлении, обновлении или удалении.</details>
<details><summary><strong>Нет включенных сервисов. Пожалуйста, включите хотя бы один сервис</strong></summary> Вам необходимо включить хотя бы один сервис IndexNow, прежде чем нажимать кнопку "Отправить URL из очереди".</details>';
$_['text_faq']                            = '<details><summary><strong>Как включить или отключить расширение для каждого магазина?</strong></summary><p>Вы можете включить или отключить расширение для каждого магазина отдельно через настройки расширения.</p></details>
<details><summary><strong>Могу ли я включить или отключить сервисы IndexNow для каждого магазина?</strong></summary><p>Да, вы можете включать или отключать сервисы IndexNow для каждого магазина индивидуально в настройках расширения.</p></details>
<details><summary><strong>Как сгенерировать ключ сервиса для каждого магазина?</strong></summary><p>Ключ сервиса генерируется автоматически при установке и уникален для каждого магазина. Вам не нужно генерировать его вручную.</p></details>
<details><summary><strong>Могу ли я пере-сгенерировать ключ сервиса для каждого магазина?</strong></summary><p>Да, вы можете пере-сгенерировать ключ сервиса для каждого магазина отдельно через настройки расширения. Это позволяет обновить или изменить ключ по мере необходимости.</p></details>
<details><summary><strong>Могу ли я использовать пользовательский URL Cron для отправки URL в сервисы IndexNow?</strong></summary><p>Да, вы можете выбрать использовать либо URL Cron, предоставленный расширением, либо URL страницы Cron OpenCart для отправки URL в очередь. Оба варианта работают без проблем.</p></details>
<details><summary><strong>Каковы ограничения по размеру и количеству URL для карты сайта?</strong></summary><p>Файл карты сайта может быть размером до 50 МБ и содержать до 50 000 URL. Убедитесь, что ваша карта сайта не превышает эти ограничения.</p></details>
<details><summary><strong>Как отправить URL в сервисы IndexNow?</strong></summary><p>Вы можете отправить URL в сервисы IndexNow, импортировав карту сайта, загрузив XML-файл карты сайта или вручную введя URL карты сайта. Также можно отправить отдельные URL из очереди или отправить все URL из очереди сразу для выбранного магазина.</p></details>
<details><summary><strong>Как очистить журнал отправки URL?</strong></summary><p>Вы можете очистить журнал во вкладке "Журнал". Журнал очищается без ошибок при любом выборе для очистки.</p></details>';
$_['text_contact']                        = '<p>For further assistance, please reach out to our support team:</p><ul><li><strong>Contact:</strong> <a href="mailto:%s">%s</a></li><li><strong>Documentation:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">User Documentation</a></li></ul>';
$_['text_log_no_results']                 = 'На данный момент нет записей в журнале.';
$_['text_queue_no_results']               = 'В очереди нет ожидающих URL-адресов.';
$_['text_categories']                     = 'Категории на вашем сайте добавлены, обновлены или удалены.';
$_['text_products']                       = 'Продукты на вашем сайте добавлены, обновлены или удалены.';
$_['text_manufacturers']                  = 'Производители на вашем сайте добавлены, обновлены или удалены.';
$_['text_information']                    = 'Информационные страницы на вашем сайте добавлены, обновлены или удалены.';
$_['text_topics']                         = 'Темы статей на вашем сайте добавлены, обновлены или удалены.';
$_['text_articles']                       = 'Статьи на вашем сайте добавлены, обновлены или удалены.';
$_['text_url_list_warning']               = 'Вставленные URL-адреса будут проверены. Каждый URL должен быть правильно отформатирован с префиксом "http" или "https", и его хост должен соответствовать хосту магазина: "%s". Максимальное количество URL-адресов для отправки — 10 000.';
$_['text_http_status_code']               = 'Анализ кодов состояния HTTP-ответов от сервисов IndexNow поможет вам понять, были ли ваши запросы обработаны успешно или возникли проблемы. Эти коды предоставляют информацию о результатах индексирования URL и возможных ошибках. Для получения дополнительной информации о кодах состояния HTTP для сервисов IndexNow посетите следующие страницы:<br><br><ul><li><a href="https://www.bing.com/indexnow/getstarted" target="_blank" rel="noopener noreferrer">Microsoft Bing Webmaster Tools</a></li><li><a href="https://searchadvisor.naver.com/guide/indexnow-request" target="_blank" rel="noopener noreferrer">Naver Search Advisor</a></li><li><a href="https://napoveda.seznam.cz/cz/fulltext-hledani-v-internetu/protokol-indexnow/odeslani-vice-stranek-jednim-pozadavkem/" target="_blank" rel="noopener noreferrer">Seznam.cz</a></li><li><a href="https://yandex.com/support/webmaster/indexnow/reference/post-url.html" target="_blank" rel="noopener noreferrer">Yandex Webmaster Tools</a></li></ul>';

// Column
$_['column_log_id']                       = 'ID журнала';
$_['column_log_url']                      = 'URL';
$_['column_log_service_name']             = 'Название сервиса';
$_['column_log_status_code']              = 'Код состояния';
$_['column_log_date_added']               = 'Дата добавления';
$_['column_queue_id']                     = 'ID очереди';
$_['column_queue_url']                    = 'URL';
$_['column_queue_date_added']             = 'Дата добавления';
$_['column_queue_action']                 = 'Действие';

// Tab
$_['tab_general']                         = 'Основные';
$_['tab_manual_submit']                   = 'Ручная отправка';
$_['tab_queue']                           = 'Очередь';
$_['tab_log']                             = 'Журнал';
$_['tab_help_and_support']                = 'Справка и поддержка';

// Entry
$_['entry_status']                        = 'Статус';
$_['entry_service_key']                   = 'Ключ сервиса';
$_['entry_service_key_location']          = 'URL для ключа сервиса';
$_['entry_active_store']                  = 'Активный магазин';
$_['entry_notify_search_engines']         = 'Уведомить поисковые системы';
$_['entry_url_list']                      = 'Список URL-адресов';
$_['entry_load_sitemap']                  = 'Загрузить карту сайта';
$_['entry_cron_url']                      = 'URL Cron';

// Button
$_['button_change_key']                   = 'Изменить ключ';
$_['button_check_key']                    = 'Проверить ключ';
$_['button_submit_url']                   = 'Отправить URL';
$_['button_submit_queue']                 = 'Отправить URL из очереди';
$_['button_clear_queue']                  = 'Очистить очередь URL';
$_['button_clear_log']                    = 'Очистить журнал';
$_['button_submit_url_list']              = 'Отправить список URL';
$_['button_clear_url_list']               = 'Очистить список URL';
$_['button_upload_sitemap']               = 'Загрузить URL из карты сайта';
$_['button_import_sitemap']               = 'Импортировать URL из карты сайта';
$_['button_copy']                         = 'Копировать URL';

// Help
$_['help_service_key']                    = 'API-ключ IndexNow подтверждает право собственности на сайт и генерируется автоматически. Измените ключ, если он был скомпрометирован.';
$_['help_service_key_location']           = 'Нажмите кнопку "Проверить ключ", чтобы убедиться, что ключ доступен для поисковых систем. Это должно открыть живой URL, где находится ключ.';
$_['help_url_list']                       = 'Введите список URL, по одному на строку (до 10 000). Убедитесь, что каждый URL правильно отформатирован с "http" или "https". Нажмите "Отправить список URL", чтобы отправить URLs в выбранные сервисы IndexNow.';
$_['help_load_sitemap']                   = 'Вы можете указать URL карты сайта или загрузить файл sitemap.xml (до 50 МБ или 50 000 URL). URLs из карты сайта будут добавлены в список и отправлены в выбранный сервис IndexNow. Вы будете уведомлены, когда процесс завершится.';
$_['help_cron_url']                       = 'Добавьте этот URL в таблицу cron вашего хостинг-сервера. Он автоматически отправит <strong>все URL из очереди</strong> <strong>все настроенные магазины</strong> на <strong>выбранные конечные точки сервиса IndexNow</strong> через заданные интервалы. В качестве альтернативы, вы можете использовать <a href="%s">URL задач cron OpenCart 4</a>, чтобы отправлять URLs в конечные точки сервиса IndexNow.';

// Error
$_['error_permission']                    = 'Внимание: У вас нет прав на изменение расширения IndexNow!';
$_['error_generate_service_key']          = 'Внимание: Не удалось сгенерировать новый API-ключ!';
$_['error_remove_queue']                  = 'Внимание: Не удалось удалить URL из очереди!';
$_['error_not_configured']                = 'Внимание: Расширение IndexNow не настроено!';
$_['error_filetype']                      = 'Внимание: Неверный тип файла. Пожалуйста, загрузите правильный файл.';
$_['error_upload']                        = 'Внимание: Файл не может быть загружен.';
$_['error_download']                      = 'Внимание: Не удалось скачать файл карты сайта "%s"';
$_['error_invalid_url']                   = 'Внимание: Некорректный URL. Пожалуйста, предоставьте правильный URL.';
$_['error_invalid_url_host']              = 'Внимание: Неверный хост URL. Хост URL должен совпадать с хостом текущего URL.';
$_['error_no_services_enabled']           = 'Внимание: Нет включенных сервисов. Пожалуйста, включите хотя бы один сервис.';
$_['error_submit_url_list_empty']         = 'Внимание: Список URL пуст.';
$_['error_submit_url_list_invalid']       = 'Внимание: Вsubmitted URL list contains invalid URLs or URLs with a host that does not match the active store.';
$_['error_empty_queue']                   = 'Внимание: Очередь пуста.';
$_['error_file_upload_limit']             = 'Внимание: Размер файла превышает лимит в 50 МБ. Пожалуйста, загрузите меньший файл.';
$_['error_service_key']                   = 'API-ключ неверен. Пожалуйста, предоставьте правильный API-ключ.';
$_['error_service_key_location']          = 'Местоположение ключа сервиса недействительно. Пожалуйста, укажите правильное местоположение ключа сервиса.';
